Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаРаспоряжений_ВТБ_ГПБ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<DataProcessor>
		<Properties>
			<Name>_ВыгрузкаРаспоряжений_ВТБ_ГПБ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаталогДанных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОтдельнымиФайлами</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимВыгрузки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Статистика работы механизмов/Конфигурация/DataProcessors/_ВыгрузкаРаспоряжений_ВТБ_ГПБ/Ext/ObjectModule.bsl
#Область Регистрационные_данные

// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительнаяОбработка,
		"Выгрузка распоряжений в клиент-банк (ГПБ, ВТБ)",
		"0.30",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

#КонецОбласти

#Область Обработчики_событий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ЭтотОбъект.РежимВыгрузки = "ВТБ" Тогда
		ПроверяемыеРеквизиты.Добавить("Ответственный");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Выгрузка_в_XML

Функция ПолучитьДанныеДляВыгрузки(МассивРаспоряжений) Экспорт
	
	Если Не ПроверитьЗаполнение() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ДанныеДляВыгрузки = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
#Область ТЕКСТ_ЗАПРОСА
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	Распоряжение.Ссылка КАК Ссылка,
		|	Распоряжение.Организация КАК Организация,
		|	Распоряжение.Дата КАК Дата,
		|	Распоряжение.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	Распоряжение.РасчетныйСчет КАК РасчетныйСчет,
		|	Распоряжение.ДатаВозврата КАК ДатаВозврата,
		|	Распоряжение.Банк КАК Банк,
		|	Распоряжение.Процент КАК Процент,
		|	Распоряжение.Сумма КАК Сумма,
		|	Распоряжение.Валюта КАК Валюта,
		|	Распоряжение.ДатаРазмещения КАК ДатаРазмещения,
		|	Распоряжение.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	Распоряжение.ДоВостребования КАК ДоВостребования,
		|	Распоряжение.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК ПроцентнаяСтавкаПриДосрочномЗакрытии,
		|	Распоряжение.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
		|	Распоряжение.ВидОперации КАК ВидОперации,
		|	РеквизитыЮрЛицаОрганизации.ИНН КАК ИннЮрЛицаОрганизации,
		|	РеквизитыЮрЛицаОрганизации.КПП КАК КппЮрЛицаОрганизации,
		|	РеквизитыЮрЛицаОрганизации.Телефоны КАК ТелефонЮрЛицаОрганизации,
		|	РеквизитыПодписанта.Фамилия + "" "" + РеквизитыПодписанта.Имя + "" "" + РеквизитыПодписанта.Отчество КАК ПодписантФИО
		|ПОМЕСТИТЬ _Распоряжения
		|ИЗ
		|	Документ.Распоряжение КАК Распоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И ЮрФизЛицо = &ЮрФизЛицоОрганизации
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮрЛицаОрганизации
		|		ПО (ИСТИНА)
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыСотрудниковОрганизации.СрезПоследних(
		|				&Период,
		|				Организация = &Организация
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|					И ЮрФизЛицо = &Подписант) КАК РеквизитыПодписанта
		|		ПО (ИСТИНА)
		|ГДЕ
		|	Распоряжение.Организация = &Организация
		|	И НЕ Распоряжение.ПометкаУдаления
		|	И (Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|				И Распоряжение.РасчетныйСчет.Банк = &Банк
		|				И НАЧАЛОПЕРИОДА(Распоряжение.Дата, ДЕНЬ) = &Период
		|			ИЛИ Распоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|				И Распоряжение.Банк = &Банк
		|				И Распоряжение.ДатаРазмещения = &Период)
		|	И Распоряжение.Ссылка В(&МассивРаспоряжений)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДокРаспоряжение.Ссылка КАК Распоряжение,
		|	ДокРаспоряжение.РасчетныйСчет КАК РасчетныйСчет,
		|	НастройкиАкцептованияОперацийСрезПоследних.Организация КАК Организация,
		|	НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НастройкиАкцептованияОперацийСрезПоследних.ВидАкцепта КАК ВидАкцепта,
		|	ЕСТЬNULL(НастройкиАкцептованияОперацийСрезПоследних.ТребуетсяАкцептование, ЛОЖЬ) КАК ТребуетсяАкцепт
		|ПОМЕСТИТЬ _НастройкиАкцептования
		|ИЗ
		|	_Распоряжения КАК ДокРаспоряжение
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиАкцептованияОпераций.СрезПоследних(
		|				&КонецДня,
		|				Организация = &Организация
		|					И ВидАкцепта В (ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНО), ЗНАЧЕНИЕ(Перечисление.ВидыАкцептов.МНОСрочный30Дней4ПроцентаУКПИ))) КАК НастройкиАкцептованияОперацийСрезПоследних
		|		ПО ДокРаспоряжение.Организация = НастройкиАкцептованияОперацийСрезПоследних.Организация
		|			И ДокРаспоряжение.СчетДоверительногоУправления = НастройкиАкцептованияОперацийСрезПоследних.СчетДоверительногоУправления
		|			И (ДокРаспоряжение.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_НастройкиАкцептования.Распоряжение КАК Распоряжение,
		|	ВЫБОР
		|		КОГДА _НастройкиАкцептования.ТребуетсяАкцепт
		|			ТОГДА АкцептованиеОперацийСрезПоследних.Операция ЕСТЬ NULL
		|					ИЛИ АкцептованиеОперацийСрезПоследних.Срок <> ДАТАВРЕМЯ(1, 1, 1)
		|						И АкцептованиеОперацийСрезПоследних.Срок <= &Период
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ТребуетсяАкцепт
		|ПОМЕСТИТЬ _АкцептованиеОпераций
		|ИЗ
		|	_НастройкиАкцептования КАК _НастройкиАкцептования
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.АкцептованиеОпераций.СрезПоследних(
		|				&КонецДня,
		|				(Организация, ВидАкцепта) В
		|						(ВЫБРАТЬ
		|							_НастройкиАкцептования.Организация,
		|							_НастройкиАкцептования.ВидАкцепта
		|						ИЗ
		|							_НастройкиАкцептования КАК _НастройкиАкцептования
		|						ГДЕ
		|							_НастройкиАкцептования.ТребуетсяАкцепт)
		|					И Операция В
		|						(ВЫБРАТЬ
		|							_НастройкиАкцептования.Распоряжение
		|						ИЗ
		|							_НастройкиАкцептования КАК _НастройкиАкцептования
		|						ГДЕ
		|							_НастройкиАкцептования.ТребуетсяАкцепт
		|				
		|						ОБЪЕДИНИТЬ
		|				
		|						ВЫБРАТЬ
		|							_НастройкиАкцептования.РасчетныйСчет
		|						ИЗ
		|							_НастройкиАкцептования КАК _НастройкиАкцептования
		|						ГДЕ
		|							_НастройкиАкцептования.ТребуетсяАкцепт)) КАК АкцептованиеОперацийСрезПоследних
		|		ПО _НастройкиАкцептования.Организация = АкцептованиеОперацийСрезПоследних.Организация
		|			И _НастройкиАкцептования.ВидАкцепта = АкцептованиеОперацийСрезПоследних.ВидАкцепта
		|			И (_НастройкиАкцептования.Распоряжение = АкцептованиеОперацийСрезПоследних.Операция
		|				ИЛИ _НастройкиАкцептования.РасчетныйСчет = АкцептованиеОперацийСрезПоследних.Операция)
		|			И (_НастройкиАкцептования.ТребуетсяАкцепт)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	&Банк КАК Банк,
		|	ВЫРАЗИТЬ(ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор КАК Справочник.Договоры) КАК ДоговорСсылка,
		|	ВЫРАЗИТЬ(ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор КАК Справочник.Договоры).ВидДоговора КАК ВидДоговора,
		|	ВЫРАЗИТЬ(ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор КАК Справочник.Договоры).НомерДоговора КАК Номер,
		|	ВЫРАЗИТЬ(ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор КАК Справочник.Договоры).ДатаЗаключения КАК ДатаЗаключения
		|ПОМЕСТИТЬ _ГенСоглашения
		|ИЗ
		|	РегистрСведений.ДоговорыСчетовДоверительногоУправления.СрезПоследних(
		|			&Период,
		|			Организация = &Организация
		|				И СчетДоверительногоУправления В
		|					(ВЫБРАТЬ
		|						_Распоряжения.СчетДоверительногоУправления
		|					ИЗ
		|						_Распоряжения КАК _Распоряжения)
		|				И ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).Контрагент = ВЫРАЗИТЬ(&Банк КАК Справочник.Банки).ЮрФизЛицо
		|				И ВЫРАЗИТЬ(Договор КАК Справочник.Договоры).ВидДоговора В (ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДоговорМНО), ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДополнительноеСоглашение))) КАК ДоговорыСчетовДоверительногоУправленияСрезПоследних
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УсловияДоговоровОбщие.СрезПоследних(&Период, Организация = &Организация) КАК УсловияДоговоровОбщиеСрезПоследних
		|		ПО ((ВЫРАЗИТЬ(ДоговорыСчетовДоверительногоУправленияСрезПоследних.Договор КАК Справочник.Договоры)) = УсловияДоговоровОбщиеСрезПоследних.Договор)
		|ГДЕ
		|	ДоговорыСчетовДоверительногоУправленияСрезПоследних.Активный
		|	И (УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения ЕСТЬ NULL
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения = ДАТАВРЕМЯ(1, 1, 1)
		|			ИЛИ УсловияДоговоровОбщиеСрезПоследних.ДатаРасторжения > &Период)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	ВложенныйЗапрос.Банк КАК Банк,
		|	РеквизитыЮридическихЛицСрезПоследних.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеПоУставу
		|ПОМЕСТИТЬ _РеквизитыБанков
		|ИЗ
		|	(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|		&Банк КАК Банк
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_Распоряжения.РасчетныйСчет.Банк
		|	ИЗ
		|		_Распоряжения КАК _Распоряжения
		|	ГДЕ
		|		_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_Распоряжения.РасчетныйСчетВозвратаДенежныхСредств.Банк
		|	ИЗ
		|		_Распоряжения КАК _Распоряжения
		|	ГДЕ
		|		_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)) КАК ВложенныйЗапрос
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&Период,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыЮридическихЛицСрезПоследних
		|		ПО ВложенныйЗапрос.Банк.ЮрФизЛицо = РеквизитыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Распоряжения.Ссылка КАК Ссылка,
		|	НАЧАЛОПЕРИОДА(_Распоряжения.Дата, ДЕНЬ) КАК Дата,
		|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Распоряжения.РасчетныйСчет КАК РасчетныйСчет,
		|	_Распоряжения.ДатаВозврата КАК ДатаВозврата,
		|	_Распоряжения.Процент КАК Процент,
		|	_Распоряжения.Сумма КАК Сумма,
		|	_Распоряжения.Валюта КАК Валюта,
		|	_Распоряжения.ИннЮрЛицаОрганизации КАК ИннЮрЛицаОрганизации,
		|	_Распоряжения.КппЮрЛицаОрганизации КАК КппЮрЛицаОрганизации,
		|	_Распоряжения.ТелефонЮрЛицаОрганизации КАК ТелефонЮрЛицаОрганизации,
		|	_Распоряжения.ПодписантФИО КАК ПодписантФИО,
		|	ЕСТЬNULL(_ДопСоглашенияМНО.Номер, _ГенСоглашения.Номер) КАК НомерГенСоглашения,
		|	ЕСТЬNULL(_ДопСоглашенияМНО.ДатаЗаключения, _ГенСоглашения.ДатаЗаключения) КАК ДатаГенСоглашения,
		|	_РеквизитыБанков.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеЮрЛицаБанка
		|ПОМЕСТИТЬ _РаспоряженияНаМНО
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГенСоглашения КАК _ДопСоглашенияМНО
		|		ПО _Распоряжения.СчетДоверительногоУправления = _ДопСоглашенияМНО.СчетДоверительногоУправления
		|			И _Распоряжения.РасчетныйСчет.ДоговорМНО = _ДопСоглашенияМНО.ДоговорСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГенСоглашения КАК _ГенСоглашения
		|		ПО _Распоряжения.СчетДоверительногоУправления = _ГенСоглашения.СчетДоверительногоУправления
		|			И (_ГенСоглашения.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ДоговорМНО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыБанков КАК _РеквизитыБанков
		|		ПО (_РеквизитыБанков.Банк = &Банк)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _АкцептованиеОпераций КАК _АкцептованиеОпераций
		|		ПО _Распоряжения.Ссылка = _АкцептованиеОпераций.Распоряжение
		|ГДЕ
		|	_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|	И (НЕ _АкцептованиеОпераций.ТребуетсяАкцепт
		|			ИЛИ _Распоряжения.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеАктивамиПаевогоИнвестиционногоФонда))
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Распоряжения.Ссылка КАК Ссылка,
		|	_Распоряжения.Дата КАК Дата,
		|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	_Распоряжения.РасчетныйСчет КАК РасчетныйСчет,
		|	_Распоряжения.ДатаВозврата КАК ДатаВозврата,
		|	_Распоряжения.Банк КАК Банк,
		|	_Распоряжения.Процент КАК Процент,
		|	_Распоряжения.Сумма КАК Сумма,
		|	_Распоряжения.Валюта КАК Валюта,
		|	_Распоряжения.ИннЮрЛицаОрганизации КАК ИннЮрЛицаОрганизации,
		|	_Распоряжения.КппЮрЛицаОрганизации КАК КппЮрЛицаОрганизации,
		|	_Распоряжения.ТелефонЮрЛицаОрганизации КАК ТелефонЮрЛицаОрганизации,
		|	_Распоряжения.ПодписантФИО КАК ПодписантФИО,
		|	_Распоряжения.ДатаРазмещения КАК ДатаРазмещения,
		|	_Распоряжения.ПериодичностьВыплатыПроцентов КАК ПериодичностьВыплатыПроцентов,
		|	_Распоряжения.ДоВостребования КАК ДоВостребования,
		|	_Распоряжения.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК ПроцентнаяСтавкаПриДосрочномЗакрытии,
		|	_Распоряжения.РасчетныйСчетВозвратаДенежныхСредств КАК РасчетныйСчетВозвратаДенежныхСредств,
		|	_ГенСоглашения.Номер КАК НомерГенСоглашения,
		|	_ГенСоглашения.ДатаЗаключения КАК ДатаГенСоглашения,
		|	_РеквизитыБанкаРазмещения.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеЮрЛицаБанкаРазмещения,
		|	_РеквизитыБанкаСписания.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеЮрЛицаБанкаСписания,
		|	_РеквизитыБанкаВозврата.КраткоеНаименованиеПоУставу КАК КраткоеНаименованиеЮрЛицаБанкаВозврата,
		|	ВЫБОР
		|		КОГДА ВЫРАЗИТЬ(_Распоряжения.РасчетныйСчет.Договор КАК Справочник.Договоры).НаименованиеВладельцаДляДокументов = """"
		|			ТОГДА ВЫРАЗИТЬ(_Распоряжения.РасчетныйСчетВозвратаДенежныхСредств.Договор КАК Справочник.Договоры).НаименованиеВладельцаДляДокументов
		|		ИНАЧЕ ВЫРАЗИТЬ(_Распоряжения.РасчетныйСчет.Договор КАК Справочник.Договоры).НаименованиеВладельцаДляДокументов
		|	КОНЕЦ КАК НаименованиеВладельцаДляДокументов
		|ПОМЕСТИТЬ _РаспоряженияНаДепозиты
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ГенСоглашения КАК _ГенСоглашения
		|		ПО _Распоряжения.СчетДоверительногоУправления = _ГенСоглашения.СчетДоверительногоУправления
		|			И _Распоряжения.ДатаРазмещения >= _ГенСоглашения.ДатаЗаключения
		|			И (_ГенСоглашения.ВидДоговора = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоров.ГенСоглашениеПоДепозитнымВкладам))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыБанков КАК _РеквизитыБанкаРазмещения
		|		ПО (_РеквизитыБанкаРазмещения.Банк = &Банк)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыБанков КАК _РеквизитыБанкаСписания
		|		ПО _Распоряжения.РасчетныйСчет.Банк = _РеквизитыБанкаСписания.Банк
		|		ЛЕВОЕ СОЕДИНЕНИЕ _РеквизитыБанков КАК _РеквизитыБанкаВозврата
		|		ПО _Распоряжения.РасчетныйСчетВозвратаДенежныхСредств.Банк = _РеквизитыБанкаВозврата.Банк
		|ГДЕ
		|	_Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВложенныйЗапрос.Распоряжение КАК Распоряжение,
		|	НомераОбъектов.ВидНумерации КАК ВидНумерации,
		|	НомераОбъектов.Объект КАК Объект,
		|	НомераОбъектов.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	НомераОбъектов.Год КАК Год,
		|	ВЫБОР
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000001"" И ""000009""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 6, 1)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000010"" И ""000099""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 5, 2)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""000100"" И ""000999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 4, 3)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""001000"" И ""009999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 3, 4)
		|		КОГДА НомераОбъектов.Номер МЕЖДУ ""010000"" И ""099999""
		|			ТОГДА ПОДСТРОКА(НомераОбъектов.Номер, 2, 5)
		|		ИНАЧЕ НомераОбъектов.Номер
		|	КОНЕЦ КАК Номер
		|ПОМЕСТИТЬ _НомераПодтверждений
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РаспоряженияНаМНО.Ссылка КАК Распоряжение,
		|		_РаспоряженияНаМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления
		|	ИЗ
		|		_РаспоряженияНаМНО КАК _РаспоряженияНаМНО
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_РаспоряженияНаДепозиты.Ссылка,
		|		_РаспоряженияНаДепозиты.СчетДоверительногоУправления
		|	ИЗ
		|		_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты) КАК ВложенныйЗапрос
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НомераОбъектов КАК НомераОбъектов
		|		ПО ВложенныйЗапрос.СчетДоверительногоУправления = НомераОбъектов.СчетДоверительногоУправления
		|			И ВложенныйЗапрос.Распоряжение = НомераОбъектов.Объект
		|			И (НомераОбъектов.Организация = &Организация)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_Распоряжения.Ссылка КАК Ссылка,
		|	_Распоряжения.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА ""Депозит""
		|		КОГДА _Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА ""МНО""
		|	КОНЕЦ КАК ВидРаспоряжения,
		|	_Распоряжения.Процент КАК Ставка,
		|	_Распоряжения.Сумма КАК Сумма,
		|	_Распоряжения.СчетДоверительногоУправления КАК Параметр_2,
		|	""Не удалось сформировать данные для выгрузки распоряжения [%1]. Счет ДУ [%2]. Не удалось получить реквизиты юр. лица организации."" КАК ТекстСообщения
		|ПОМЕСТИТЬ _ОшибкиРаспоряжений
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|ГДЕ
		|	&РежимВыгрузки = ""ГПБ""
		|	И _Распоряжения.ИннЮрЛицаОрганизации ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_Распоряжения.Ссылка,
		|	_Распоряжения.СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА _Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.РазмещениеКредитногоИнструмента)
		|			ТОГДА ""Депозит""
		|		КОГДА _Распоряжения.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийБэкОфиса.МНО)
		|			ТОГДА ""МНО""
		|	КОНЕЦ,
		|	_Распоряжения.Процент,
		|	_Распоряжения.Сумма,
		|	_Распоряжения.СчетДоверительногоУправления,
		|	""Не удалось сформировать данные для выгрузки распоряжения [%1]. Не удалось получить реквизиты подписанта [%2].""
		|ИЗ
		|	_Распоряжения КАК _Распоряжения
		|ГДЕ
		|	&РежимВыгрузки = ""ВТБ""
		|	И _Распоряжения.ПодписантФИО ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	_РаспоряженияНаМНО.Ссылка,
		|	_РаспоряженияНаМНО.СчетДоверительногоУправления,
		|	""МНО"",
		|	_РаспоряженияНаМНО.Процент,
		|	_РаспоряженияНаМНО.Сумма,
		|	_РаспоряженияНаМНО.СчетДоверительногоУправления,
		|	""У МНО [%1] не установлен номер подтверждения. Счет ДУ [%2]""
		|ИЗ
		|	_РаспоряженияНаМНО КАК _РаспоряженияНаМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НомераПодтверждений КАК _НомераПодтверждений
		|		ПО _РаспоряженияНаМНО.Ссылка = _НомераПодтверждений.Распоряжение
		|ГДЕ
		|	_НомераПодтверждений.Номер ЕСТЬ NULL
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ВидРаспоряжения,
		|	ВложенныйЗапрос.Процент,
		|	ВложенныйЗапрос.Сумма,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	""Не удалось сформировать данные для выгрузки распоряжения [%1]. Не удалось определить ген. соглашение для счета ДУ [%2]""
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РаспоряженияНаМНО.Ссылка КАК Ссылка,
		|		_РаспоряженияНаМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		""МНО"" КАК ВидРаспоряжения,
		|		_РаспоряженияНаМНО.Процент КАК Процент,
		|		_РаспоряженияНаМНО.Сумма КАК Сумма
		|	ИЗ
		|		_РаспоряженияНаМНО КАК _РаспоряженияНаМНО
		|	ГДЕ
		|		_РаспоряженияНаМНО.НомерГенСоглашения ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_РаспоряженияНаДепозиты.Ссылка,
		|		_РаспоряженияНаДепозиты.СчетДоверительногоУправления,
		|		""Депозит"",
		|		_РаспоряженияНаДепозиты.Процент,
		|		_РаспоряженияНаДепозиты.Сумма
		|	ИЗ
		|		_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты
		|	ГДЕ
		|		_РаспоряженияНаДепозиты.НомерГенСоглашения ЕСТЬ NULL) КАК ВложенныйЗапрос
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ВидРаспоряжения,
		|	ВложенныйЗапрос.Процент,
		|	ВложенныйЗапрос.Сумма,
		|	ВложенныйЗапрос.РасчетныйСчет,
		|	""Не удалось сформировать данные для выгрузки распоряжения [%1]. Не удалось получить наименование владельца для документов из договора расчетного счета [%2]""
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РаспоряженияНаМНО.Ссылка КАК Ссылка,
		|		_РаспоряженияНаМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		""МНО"" КАК ВидРаспоряжения,
		|		_РаспоряженияНаМНО.Процент КАК Процент,
		|		_РаспоряженияНаМНО.Сумма КАК Сумма,
		|		_РаспоряженияНаМНО.РасчетныйСчет КАК РасчетныйСчет
		|	ИЗ
		|		_РаспоряженияНаМНО КАК _РаспоряженияНаМНО
		|	ГДЕ
		|		&РежимВыгрузки = ""ГПБ""
		|		И ВЫРАЗИТЬ(_РаспоряженияНаМНО.РасчетныйСчет.Договор КАК Справочник.Договоры).НаименованиеВладельцаДляДокументов = """"
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_РаспоряженияНаДепозиты.Ссылка,
		|		_РаспоряженияНаДепозиты.СчетДоверительногоУправления,
		|		""Депозит"",
		|		_РаспоряженияНаДепозиты.Процент,
		|		_РаспоряженияНаДепозиты.Сумма,
		|		_РаспоряженияНаДепозиты.РасчетныйСчет
		|	ИЗ
		|		_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты
		|	ГДЕ
		|		_РаспоряженияНаДепозиты.НаименованиеВладельцаДляДокументов = """") КАК ВложенныйЗапрос
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.Ссылка,
		|	ВложенныйЗапрос.СчетДоверительногоУправления,
		|	ВложенныйЗапрос.ВидРаспоряжения,
		|	ВложенныйЗапрос.Процент,
		|	ВложенныйЗапрос.Сумма,
		|	ВложенныйЗапрос.Банк,
		|	""Не удалось сформировать данные для выгрузки распоряжения [%1]. Не удалось получить реквизиты банка [%2]""
		|ИЗ
		|	(ВЫБРАТЬ
		|		_РаспоряженияНаМНО.Ссылка КАК Ссылка,
		|		_РаспоряженияНаМНО.СчетДоверительногоУправления КАК СчетДоверительногоУправления,
		|		""МНО"" КАК ВидРаспоряжения,
		|		_РаспоряженияНаМНО.Процент КАК Процент,
		|		_РаспоряженияНаМНО.Сумма КАК Сумма,
		|		&Банк КАК Банк
		|	ИЗ
		|		_РаспоряженияНаМНО КАК _РаспоряженияНаМНО
		|	ГДЕ
		|		&РежимВыгрузки = ""ГПБ""
		|		И _РаспоряженияНаМНО.КраткоеНаименованиеЮрЛицаБанка ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_РаспоряженияНаДепозиты.Ссылка,
		|		_РаспоряженияНаДепозиты.СчетДоверительногоУправления,
		|		""Депозит"",
		|		_РаспоряженияНаДепозиты.Процент,
		|		_РаспоряженияНаДепозиты.Сумма,
		|		&Банк
		|	ИЗ
		|		_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты
		|	ГДЕ
		|		_РаспоряженияНаДепозиты.КраткоеНаименованиеЮрЛицаБанкаРазмещения ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_РаспоряженияНаДепозиты.Ссылка,
		|		_РаспоряженияНаДепозиты.СчетДоверительногоУправления,
		|		""Депозит"",
		|		_РаспоряженияНаДепозиты.Процент,
		|		_РаспоряженияНаДепозиты.Сумма,
		|		_РаспоряженияНаДепозиты.РасчетныйСчет.Банк
		|	ИЗ
		|		_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты
		|	ГДЕ
		|		_РаспоряженияНаДепозиты.КраткоеНаименованиеЮрЛицаБанкаСписания ЕСТЬ NULL
		|	
		|	ОБЪЕДИНИТЬ
		|	
		|	ВЫБРАТЬ
		|		_РаспоряженияНаДепозиты.Ссылка,
		|		_РаспоряженияНаДепозиты.СчетДоверительногоУправления,
		|		""Депозит"",
		|		_РаспоряженияНаДепозиты.Процент,
		|		_РаспоряженияНаДепозиты.Сумма,
		|		_РаспоряженияНаДепозиты.РасчетныйСчетВозвратаДенежныхСредств.Банк
		|	ИЗ
		|		_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты
		|	ГДЕ
		|		_РаспоряженияНаДепозиты.КраткоеНаименованиеЮрЛицаБанкаВозврата ЕСТЬ NULL) КАК ВложенныйЗапрос
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РаспоряженияНаМНО.СчетДоверительногоУправления КАК _СчетДоверительногоУправления,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""ДФ=ddMMyyyy""
		|		ИНАЧЕ ""ДФ=ddMMyyyyhhmmss""
		|	КОНЕЦ КАК _ФорматнаяСтрокаДат,
		|	_НомераПодтверждений.Номер КАК _НомерПодтверждения,
		|	""485D2ECC30484DDFA65F3CB18F8F70D0"" КАК _TYPE,
		|	ВЫБОР
		|		КОГДА ЕСТЬNULL(ЗначенияДополнительныхСведений.Значение, ЛОЖЬ) = ИСТИНА
		|			ТОГДА ""INTERNET""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК _id,
		|	_РаспоряженияНаМНО.Процент КАК _Ставка,
		|	_РаспоряженияНаМНО.Сумма КАК _Сумма,
		|	""Да"" КАК DC_RECIPIENT_ACCOUNT_OWN,
		|	_НомераПодтверждений.Номер КАК OHD_NUMBER,
		|	_РаспоряженияНаМНО.РасчетныйСчет.НомерСчета КАК DD_MNOACCOUNT,
		|	_РаспоряженияНаМНО.РасчетныйСчет.НомерСчета КАК DC_RECIPIENT_ACCOUNT,
		|	_РаспоряженияНаМНО.РасчетныйСчет.НомерСчета КАК DC_CLIENT_ACCOUNT,
		|	_РаспоряженияНаМНО.НомерГенСоглашения КАК DC_AGREEMENT_NUMBER,
		|	_РаспоряженияНаМНО.ДатаГенСоглашения КАК DC_AGREEMENT_DATE,
		|	_РаспоряженияНаМНО.Дата КАК DC_DISPOSAL_DATE,
		|	_РаспоряженияНаМНО.Дата КАК OHD_DATE,
		|	_РаспоряженияНаМНО.ДатаВозврата КАК DC_RETURN_DATE,
		|	_РаспоряженияНаМНО.Процент КАК DC_INTEREST_RATE,
		|	_РаспоряженияНаМНО.КраткоеНаименованиеЮрЛицаБанка КАК DC_BANK_NAME,
		|	_РаспоряженияНаМНО.КраткоеНаименованиеЮрЛицаБанка КАК DC_RETURN_INFO,
		|	_РаспоряженияНаМНО.ИннЮрЛицаОрганизации КАК DC_CLIENT_INN,
		|	1 КАК DC_RESTTYPE,
		|	ВЫБОР
		|		КОГДА _РаспоряженияНаМНО.Валюта = &РоссийскийРубль
		|			ТОГДА ""RUR""
		|		ИНАЧЕ _РаспоряженияНаМНО.Валюта.Наименование
		|	КОНЕЦ КАК OHD_CURRENCY,
		|	_РаспоряженияНаМНО.Сумма КАК OHD_AMOUNT,
		|	_РаспоряженияНаМНО.КппЮрЛицаОрганизации КАК DC_CLIENT_KPP,
		|	ВЫРАЗИТЬ(_РаспоряженияНаМНО.РасчетныйСчет.Договор КАК Справочник.Договоры).НаименованиеВладельцаДляДокументов КАК DC_CLIENT_NAME,
		|	_РаспоряженияНаМНО.РасчетныйСчет.Банк.Код КАК DC_RECIPIENT_BIC,
		|	"""" КАК DC_RECIPIENT_SWIFT
		|ПОМЕСТИТЬ _РаспоряженияНаМноГПБ
		|ИЗ
		|	_РаспоряженияНаМНО КАК _РаспоряженияНаМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НомераПодтверждений КАК _НомераПодтверждений
		|		ПО _РаспоряженияНаМНО.Ссылка = _НомераПодтверждений.Распоряжение
		|			И _РаспоряженияНаМНО.СчетДоверительногоУправления = _НомераПодтверждений.СчетДоверительногоУправления
		|			И (_НомераПодтверждений.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияДополнительныхСведений КАК ЗначенияДополнительныхСведений
		|		ПО (ЗначенияДополнительныхСведений.Свойство.Ключ = ""ВыгрузкаРаспоряженийНаМНОВГПБ_ИспользоватьСокращенныйФорматДат"")
		|			И (ЗначенияДополнительныхСведений.Объект = &Организация)
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиРаспоряжений КАК _ОшибкиРаспоряжений
		|		ПО _РаспоряженияНаМНО.Ссылка = _ОшибкиРаспоряжений.Ссылка
		|ГДЕ
		|	&РежимВыгрузки = ""ГПБ""
		|	И _ОшибкиРаспоряжений.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РаспоряженияНаМНО.СчетДоверительногоУправления КАК _СчетДоверительногоУправления,
		|	""ДФ=yyyy-MM-dd"" КАК _ФорматнаяСтрокаДат,
		|	_НомераПодтверждений.Номер КАК _НомерПодтверждения,
		|	_РаспоряженияНаМНО.Процент КАК _Ставка,
		|	_РаспоряженияНаМНО.Сумма КАК _Сумма,
		|	_НомераПодтверждений.Номер КАК documentNumber,
		|	_РаспоряженияНаМНО.Дата КАК documentDate,
		|	_РаспоряженияНаМНО.РасчетныйСчет.НомерСчета КАК nsoAccount,
		|	_РаспоряженияНаМНО.РасчетныйСчет.Банк.Код КАК nsoBic,
		|	_РаспоряженияНаМНО.ПодписантФИО КАК employeeFIO,
		|	_РаспоряженияНаМНО.ТелефонЮрЛицаОрганизации КАК employeePhone,
		|	_РаспоряженияНаМНО.Сумма КАК amount,
		|	_РаспоряженияНаМНО.Дата КАК startDate,
		|	_РаспоряженияНаМНО.ДатаВозврата КАК endDate,
		|	РАЗНОСТЬДАТ(_РаспоряженияНаМНО.Дата, _РаспоряженияНаМНО.ДатаВозврата, ДЕНЬ) КАК term,
		|	_РаспоряженияНаМНО.Процент КАК rate,
		|	""NSO"" КАК interestPayoutOption
		|ПОМЕСТИТЬ _РаспоряженияНаМноВТБ
		|ИЗ
		|	_РаспоряженияНаМНО КАК _РаспоряженияНаМНО
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НомераПодтверждений КАК _НомераПодтверждений
		|		ПО _РаспоряженияНаМНО.Ссылка = _НомераПодтверждений.Распоряжение
		|			И _РаспоряженияНаМНО.СчетДоверительногоУправления = _НомераПодтверждений.СчетДоверительногоУправления
		|			И (_НомераПодтверждений.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.РаспоряженияНаМНО))
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиРаспоряжений КАК _ОшибкиРаспоряжений
		|		ПО _РаспоряженияНаМНО.Ссылка = _ОшибкиРаспоряжений.Ссылка
		|ГДЕ
		|	&РежимВыгрузки = ""ВТБ""
		|	И _ОшибкиРаспоряжений.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РаспоряженияНаДепозиты.СчетДоверительногоУправления КАК _СчетДоверительногоУправления,
		|	""ДФ=ddMMyyyyhhmmss"" КАК _ФорматнаяСтрокаДат,
		|	"""" КАК _НомерПодтверждения,
		|	""532EDED615024E60AE9A56D4FBE553A3"" КАК _TYPE,
		|	"""" КАК _id,
		|	_РаспоряженияНаДепозиты.Процент КАК _Ставка,
		|	_РаспоряженияНаДепозиты.Сумма КАК _Сумма,
		|	_РаспоряженияНаДепозиты.РасчетныйСчет.Банк.Код КАК DC_PAY_INTEREST_BIC,
		|	_РаспоряженияНаДепозиты.РасчетныйСчет.НомерСчета КАК DC_PAY_INTEREST_ACCOUNT,
		|	_РаспоряженияНаДепозиты.КраткоеНаименованиеЮрЛицаБанкаСписания + "" "" + _РаспоряженияНаДепозиты.РасчетныйСчет.Банк.Адрес + "" "" + _РаспоряженияНаДепозиты.РасчетныйСчет.Банк.Код КАК DC_PAY_INTEREST_BANK_NAME,
		|	_РаспоряженияНаДепозиты.ДатаВозврата КАК DC_RETURN_DATE,
		|	_РаспоряженияНаДепозиты.Процент КАК DC_INTEREST_RATE,
		|	_РаспоряженияНаДепозиты.Сумма КАК OHD_AMOUNT,
		|	ВЫБОР
		|		КОГДА _РаспоряженияНаДепозиты.Валюта = &РоссийскийРубль
		|			ТОГДА ""RUR""
		|		ИНАЧЕ _РаспоряженияНаДепозиты.Валюта.Наименование
		|	КОНЕЦ КАК OHD_CURRENCY,
		|	_РаспоряженияНаДепозиты.ИннЮрЛицаОрганизации КАК DC_CLIENT_INN,
		|	_РаспоряженияНаДепозиты.КппЮрЛицаОрганизации КАК DC_CLIENT_KPP,
		|	_РаспоряженияНаДепозиты.ТелефонЮрЛицаОрганизации КАК DC_CLIENT_PHONE,
		|	_РаспоряженияНаДепозиты.ПодписантФИО КАК DC_CLIENT_FIO,
		|	_РаспоряженияНаДепозиты.ПодписантФИО КАК OH_CREATORID,
		|	_РаспоряженияНаДепозиты.ПодписантФИО КАК OH_MODIFIERID,
		|	_РаспоряженияНаДепозиты.ДатаРазмещения КАК DC_DISPOSAL_DATE,
		|	_РаспоряженияНаДепозиты.ДатаРазмещения КАК OHD_DATE,
		|	ВЫБОР
		|		КОГДА _РаспоряженияНаДепозиты.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.ВКонцеСрока)
		|			ТОГДА ""1-в конце срока""
		|		КОГДА _РаспоряженияНаДепозиты.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Ежемесячно)
		|			ТОГДА ""2-ежемесячно""
		|		КОГДА _РаспоряженияНаДепозиты.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Ежеквартально)
		|			ТОГДА ""3-ежеквартально""
		|		КОГДА _РаспоряженияНаДепозиты.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Ежеквартально)
		|			ТОГДА ""5-прочее""
		|	КОНЕЦ КАК DC_PAY_ORDER,
		|	_РаспоряженияНаДепозиты.РасчетныйСчетВозвратаДенежныхСредств.НомерСчета КАК DC_RETURN_ACCOUNT,
		|	_РаспоряженияНаДепозиты.КраткоеНаименованиеЮрЛицаБанкаВозврата + "" "" + _РаспоряженияНаДепозиты.РасчетныйСчетВозвратаДенежныхСредств.Банк.Адрес + "" "" + _РаспоряженияНаДепозиты.РасчетныйСчетВозвратаДенежныхСредств.Банк.Код КАК DC_RETURN_INFO,
		|	_РаспоряженияНаДепозиты.КраткоеНаименованиеЮрЛицаБанкаВозврата КАК DC_RETURN_BANK_NAME,
		|	_РаспоряженияНаДепозиты.НаименованиеВладельцаДляДокументов КАК DC_ADDITION_CONDITION,
		|	_РаспоряженияНаДепозиты.КраткоеНаименованиеЮрЛицаБанкаРазмещения КАК DC_BANK_NAME,
		|	_РаспоряженияНаДепозиты.НаименованиеВладельцаДляДокументов КАК DC_CLIENT_NAME,
		|	_РаспоряженияНаДепозиты.РасчетныйСчетВозвратаДенежныхСредств.Банк.Код КАК DC_RETURN_BIC,
		|	_РаспоряженияНаДепозиты.НомерГенСоглашения КАК DC_AGREEMENT_NUMBER,
		|	_РаспоряженияНаДепозиты.ДатаГенСоглашения КАК DC_AGREEMENT_DATE
		|ПОМЕСТИТЬ _РаспоряженияНаДепозитыГПБ
		|ИЗ
		|	_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиРаспоряжений КАК _ОшибкиРаспоряжений
		|		ПО _РаспоряженияНаДепозиты.Ссылка = _ОшибкиРаспоряжений.Ссылка
		|ГДЕ
		|	&РежимВыгрузки = ""ГПБ""
		|	И _ОшибкиРаспоряжений.Ссылка ЕСТЬ NULL
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	_РаспоряженияНаДепозиты.СчетДоверительногоУправления КАК _СчетДоверительногоУправления,
		|	""ДФ=yyyy-MM-dd"" КАК _ФорматнаяСтрокаДат,
		|	_РаспоряженияНаДепозиты.Процент КАК _Ставка,
		|	_РаспоряженияНаДепозиты.Сумма КАК _Сумма,
		|	_НомераПодтверждений.Номер КАК documentNumber,
		|	_РаспоряженияНаДепозиты.ДатаРазмещения КАК documentDate,
		|	КодыВоВнешнихСистемахСрезПоследних.Код КАК orgDBOId,
		|	_РаспоряженияНаДепозиты.НомерГенСоглашения КАК agreementNumber,
		|	_РаспоряженияНаДепозиты.ДатаГенСоглашения КАК agreementDate,
		|	_РаспоряженияНаДепозиты.ПодписантФИО КАК employeeFIO,
		|	_РаспоряженияНаДепозиты.ТелефонЮрЛицаОрганизации КАК employeePhone,
		|	""IAM"" КАК productCode,
		|	_РаспоряженияНаДепозиты.Валюта.Наименование КАК currencyName,
		|	_РаспоряженияНаДепозиты.Сумма КАК amount,
		|	_РаспоряженияНаДепозиты.ДатаРазмещения КАК startDate,
		|	_РаспоряженияНаДепозиты.ДатаВозврата КАК endDate,
		|	РАЗНОСТЬДАТ(_РаспоряженияНаДепозиты.ДатаРазмещения, _РаспоряженияНаДепозиты.ДатаВозврата, ДЕНЬ) КАК term,
		|	_РаспоряженияНаДепозиты.Процент КАК rate,
		|	ВЫБОР
		|		КОГДА _РаспоряженияНаДепозиты.ДоВостребования
		|			ТОГДА ""true""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК earlyTerminationAvailable,
		|	_РаспоряженияНаДепозиты.ПроцентнаяСтавкаПриДосрочномЗакрытии КАК demandRate,
		|	ВЫБОР
		|		КОГДА _РаспоряженияНаДепозиты.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.ВКонцеСрока)
		|			ТОГДА ""TERM""
		|		КОГДА _РаспоряженияНаДепозиты.ПериодичностьВыплатыПроцентов = ЗНАЧЕНИЕ(Перечисление.ПериодичностиВыплатыПроцентов.Ежемесячно)
		|			ТОГДА ""MONTH""
		|		ИНАЧЕ """"
		|	КОНЕЦ КАК interestPayoutPeriod,
		|	""<accountNumber>"" + _РаспоряженияНаДепозиты.РасчетныйСчет.НомерСчета + ""</accountNumber><bic>"" + _РаспоряженияНаДепозиты.РасчетныйСчет.Банк.Код + ""</bic>"" КАК depositSources,
		|	""<accountNumber>"" + _РаспоряженияНаДепозиты.РасчетныйСчетВозвратаДенежныхСредств.НомерСчета + ""</accountNumber><bic>"" + _РаспоряженияНаДепозиты.РасчетныйСчетВозвратаДенежныхСредств.Банк.Код + ""</bic>"" КАК refundAccount,
		|	""DEPOSIT_REFUND"" КАК interestPayoutOption
		|ПОМЕСТИТЬ _РаспоряженияНаДепозитыВТБ
		|ИЗ
		|	_РаспоряженияНаДепозиты КАК _РаспоряженияНаДепозиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ _ОшибкиРаспоряжений КАК _ОшибкиРаспоряжений
		|		ПО _РаспоряженияНаДепозиты.Ссылка = _ОшибкиРаспоряжений.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ _НомераПодтверждений КАК _НомераПодтверждений
		|		ПО _РаспоряженияНаДепозиты.Ссылка = _НомераПодтверждений.Распоряжение
		|			И _РаспоряженияНаДепозиты.СчетДоверительногоУправления = _НомераПодтверждений.СчетДоверительногоУправления
		|			И (_НомераПодтверждений.ВидНумерации = ЗНАЧЕНИЕ(Справочник.ВидыНумерацииОбъектов.ПодтвержденияВТБ))
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КодыВоВнешнихСистемах.СрезПоследних(
		|				&Период,
		|				ВнешняяСистема = ЗНАЧЕНИЕ(Справочник.ВнешниеСистемы.БанкКлиентВТБ)
		|					И ГруппаОбъектов = ЗНАЧЕНИЕ(Справочник.ГруппыИмпортируемыхОбъектов.Организации)) КАК КодыВоВнешнихСистемахСрезПоследних
		|		ПО (КодыВоВнешнихСистемахСрезПоследних.Объект = &Организация)
		|ГДЕ
		|	&РежимВыгрузки = ""ВТБ""
		|	И _ОшибкиРаспоряжений.Ссылка ЕСТЬ NULL";
#КонецОбласти

	Запрос.УстановитьПараметр("Период",	ЭтотОбъект.Период);
	Запрос.УстановитьПараметр("КонецДня", КонецДня(ЭтотОбъект.Период));
	Запрос.УстановитьПараметр("Организация", ЭтотОбъект.Организация);
	Запрос.УстановитьПараметр("Это_УК_Траст", ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_ТрастМ"));
	Запрос.УстановитьПараметр("Это_УК_РЭМ", ЭтотОбъект.Организация = ОбщегоНазначения.ПолучитьИменованныйОбъект("Организация_РЭМ"));
	Запрос.УстановитьПараметр("ЮрФизЛицоОрганизации", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЭтотОбъект.Организация, "ЮрФизЛицо"));
	Запрос.УстановитьПараметр("МассивРаспоряжений", МассивРаспоряжений);
	Запрос.УстановитьПараметр("РоссийскийРубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Запрос.УстановитьПараметр("Банк", ?(ЭтотОбъект.РежимВыгрузки = "ГПБ", ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ГПБ"), ОбщегоНазначения.ПолучитьИменованныйОбъект("Банк_ВТБ")));
	Запрос.УстановитьПараметр("Подписант", ЭтотОбъект.Ответственный);
	Запрос.УстановитьПараметр("РежимВыгрузки", ЭтотОбъект.РежимВыгрузки);

	Результат = Запрос.Выполнить();
	
	ВыборкаОшибок = Запрос.МенеджерВременныхТаблиц.Таблицы["_ОшибкиРаспоряжений"].ПолучитьДанные().Выбрать();
	
	Если ВыборкаОшибок.Количество() > 0 Тогда
		
		Пока ВыборкаОшибок.Следующий() Цикл	
			ДанныеДляВыгрузки.Добавить(Новый Структура("СчетДоверительногоУправления, ВидРаспоряжения, Ставка, Сумма, ВременныйФайл, ТекстСообщения", ВыборкаОшибок.СчетДоверительногоУправления, ВыборкаОшибок.ВидРаспоряжения, ВыборкаОшибок.Ставка, ВыборкаОшибок.Сумма, Неопределено, СтрШаблон(ВыборкаОшибок.ТекстСообщения, ВыборкаОшибок.Ссылка, ВыборкаОшибок.Параметр_2)));
		КонецЦикла;
		
	КонецЕсли;
	
	Если ЭтотОбъект.РежимВыгрузки = "ГПБ" Тогда
		
		ТипыАтрибутов = ПолучитьТипыАтрибутов();
		
		ТалицаРаспоряжений = Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаМноГПБ"].ПолучитьДанные().Выгрузить();
	
		Если ТалицаРаспоряжений.Количество() > 0 Тогда
			
			РаботаСКоллекциями.ДополнитьМассив(ДанныеДляВыгрузки, СформироватьДанныеДляВыгрузки(ТалицаРаспоряжений, "МНО", ТипыАтрибутов));
			
		ИначеЕсли Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаМНО"].ПолучитьДанные().Выбрать().Количество() > 0 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные распоряжений на МНО (Банк ГПБ) на дату [" + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy") + "].");	
		КонецЕсли;
	
		ТалицаРаспоряжений = Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаДепозитыГПБ"].ПолучитьДанные().Выгрузить();
	
		Если ТалицаРаспоряжений.Количество() > 0 Тогда
			
			РаботаСКоллекциями.ДополнитьМассив(ДанныеДляВыгрузки, СформироватьДанныеДляВыгрузки(ТалицаРаспоряжений, "Депозит", ТипыАтрибутов));
			
		ИначеЕсли Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаДепозиты"].ПолучитьДанные().Выбрать().Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные распоряжений на размещение депозитов (Банк ГПБ) на дату[" + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy") + "].");	
		КонецЕсли;
		
	ИначеЕсли ЭтотОбъект.РежимВыгрузки = "ВТБ" Тогда

		ТалицаРаспоряжений = Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаМноВТБ"].ПолучитьДанные().Выгрузить();
	
		Если ТалицаРаспоряжений.Количество() > 0 Тогда
			
			РаботаСКоллекциями.ДополнитьМассив(ДанныеДляВыгрузки, СформироватьДанныеДляВыгрузки(ТалицаРаспоряжений, "МНО"));
	
		ИначеЕсли Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаМНО"].ПолучитьДанные().Выбрать().Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные распоряжений на МНО (Банк ВТБ) на дату [" + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy") + "].");	
		КонецЕсли;
		
		ТалицаРаспоряжений = Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаДепозитыВТБ"].ПолучитьДанные().Выгрузить();
	
		Если ТалицаРаспоряжений.Количество() > 0 Тогда
			
			РаботаСКоллекциями.ДополнитьМассив(ДанныеДляВыгрузки, СформироватьДанныеДляВыгрузки(ТалицаРаспоряжений, "Депозит"));
			
		ИначеЕсли Запрос.МенеджерВременныхТаблиц.Таблицы["_РаспоряженияНаДепозиты"].ПолучитьДанные().Выбрать().Количество() > 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получить данные распоряжений на размещение депозитов (Банк ВТБ) на дату[" + Формат(ЭтотОбъект.Период, "ДФ=dd.MM.yyyy") + "].");	
		КонецЕсли;
	
	КонецЕсли;
	
	Если ДанныеДляВыгрузки.Количество() > 0 Тогда
		Возврат ДанныеДляВыгрузки;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
		
КонецФункции

Функция СформироватьДанныеДляВыгрузки(ТаблицаДанных1С, ВидРаспоряжения, ТипыАтрибутов = Неопределено)
	
	МассивДанных = Новый Массив;
	
	МассивИменПолей = Новый Массив;
	
	Для Каждого Колонка Из ТаблицаДанных1С.Колонки Цикл
		
		Если Лев(Колонка.Имя, 1) = "_" Тогда
			Продолжить;	
		КонецЕсли;
		
		МассивИменПолей.Добавить(Колонка.Имя);
			
	КонецЦикла;
	
	ИмяФайла = ПолучитьИмяФайла();
	ТекЗаписьXML = ПолучитьЗаписьXML(ИмяФайла, ВидРаспоряжения);	
	
	Для Каждого СтрокаДанных Из ТаблицаДанных1С Цикл
		
		Если ЭтотОбъект.РежимВыгрузки = "ГПБ" Тогда	
			
			ТекЗаписьXML.ЗаписатьНачалоЭлемента("doc");
			
			Если ЗначениеЗаполнено(СтрокаДанных._id) Тогда
				ТекЗаписьXML.ЗаписатьАтрибут("profile", СтрокаДанных._id);
			Иначе
				ТекЗаписьXML.ЗаписатьАтрибут("id", "");
			КонецЕсли;
				
			ТекЗаписьXML.ЗаписатьАтрибут("type", СтрокаДанных._TYPE);
	
		ИначеЕсли ЭтотОбъект.РежимВыгрузки = "ВТБ" Тогда
			
			Если ВидРаспоряжения = "МНО" Тогда
				ТекЗаписьXML.ЗаписатьНачалоЭлемента("Nso");	
			ИначеЕсли ВидРаспоряжения = "Депозит" Тогда
				ТекЗаписьXML.ЗаписатьНачалоЭлемента("Deposit");		
			КонецЕсли;
			
		КонецЕсли;
		
		Для Каждого ИмяПоля Из МассивИменПолей Цикл
			
			Если Не ЗначениеЗаполнено(СтрокаДанных[ИмяПоля]) Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЭтотОбъект.РежимВыгрузки = "ГПБ" Тогда
			
				ТекЗаписьXML.ЗаписатьНачалоЭлемента("field");
		
				ТекЗаписьXML.ЗаписатьАтрибут("id", ИмяПоля);
				ТекЗаписьXML.ЗаписатьАтрибут("datatype", ?(ТипыАтрибутов.Получить(ИмяПоля) = Неопределено, "string", ТипыАтрибутов[ИмяПоля]));
				
			ИначеЕсли ЭтотОбъект.РежимВыгрузки = "ВТБ" Тогда
				
				ТекЗаписьXML.ЗаписатьНачалоЭлемента(ИмяПоля);	
				
			КонецЕсли;
				
			Если ИмяПоля = "documentNumber" И ВидРаспоряжения = "Депозит" И ЗначениеЗаполнено(СтрокаДанных[ИмяПоля]) Тогда
				
				ТекЗначение = РаботаСоСтрокамиКлиентСервер.СократитьЛидирующиеНули(СтрокаДанных[ИмяПоля]);
				
			ИначеЕсли ИмяПоля = "employeePhone" Тогда
				
				Телефон = СокрЛП(СтрокаДанных[ИмяПоля]);
				Телефон = СтрЗаменить(Телефон, "-", "");
				Телефон = СтрЗаменить(Телефон, " ", "");
				
				ТекЗначение = Телефон;
	
			ИначеЕсли ТипЗнч(СтрокаДанных[ИмяПоля]) = Тип("Дата") Тогда
				
				ТекЗначение = Формат(СтрокаДанных[ИмяПоля], СтрокаДанных._ФорматнаяСтрокаДат);
				
			ИначеЕсли ТипЗнч(СтрокаДанных[ИмяПоля]) = Тип("Число") Тогда
				
				Если ИмяПоля = "term" Тогда 
					
					ТекЗначение = Формат(СтрокаДанных[ИмяПоля], "ЧДЦ=0; ЧГ=0");
					
				ИначеЕсли (ИмяПоля <> "DC_RESTTYPE" И ИмяПоля <> "OHD_NUMBER") Тогда
					
					ТекЗначение = Формат(СтрокаДанных[ИмяПоля], "ЧДЦ=2; ЧРД=.; ЧГ=0");
					
				Иначе
					
					ТекЗначение = СтрокаДанных[ИмяПоля];
					
				КонецЕсли;
										
			Иначе
				
				ТекЗначение = СтрокаДанных[ИмяПоля];
				
			КонецЕсли;
			
			ТекЗначение = СокрЛП(ТекЗначение);
			
			Если Не ПустаяСтрока(ТекЗначение) Тогда
				
				Если ИмяПоля = "depositSources" Или ИмяПоля = "refundAccount" Тогда
					ТекЗаписьXML.ЗаписатьБезОбработки(ТекЗначение);	
				Иначе
					ТекЗаписьXML.ЗаписатьТекст(ТекЗначение);
				КонецЕсли;
				
			КонецЕсли;
			
			ТекЗаписьXML.ЗаписатьКонецЭлемента();
			
		КонецЦикла;
		
		ТекЗаписьXML.ЗаписатьКонецЭлемента(); //ГПБ: doc, ВТБ: Nso, Deposit 
		
		Если ЭтотОбъект.ВыгружатьОтдельнымиФайлами Тогда
			
			ТекЗаписьXML.ЗаписатьКонецЭлемента(); //ГПБ: xmldoc, ВТБ: PacketNso, PacketDeposit 
			ТекЗаписьXML.Закрыть();
			
			МассивДанных.Добавить(Новый Структура("СчетДоверительногоУправления, ВидРаспоряжения, Ставка, Сумма, ВременныйФайл, ТекстСообщения", СтрокаДанных._СчетДоверительногоУправления, ВидРаспоряжения, СтрокаДанных._Ставка, СтрокаДанных._Сумма, ИмяФайла));
			
			ИмяФайла = ПолучитьИмяФайла();
			ТекЗаписьXML = ПолучитьЗаписьXML(ИмяФайла, ВидРаспоряжения);
			
		Иначе
	    	МассивДанных.Добавить(Новый Структура("СчетДоверительногоУправления, ВидРаспоряжения, Ставка, Сумма, ВременныйФайл, ТекстСообщения", СтрокаДанных._СчетДоверительногоУправления, ВидРаспоряжения, СтрокаДанных._Ставка, СтрокаДанных._Сумма, Неопределено));
		КонецЕсли;
	
	КонецЦикла;
	
	Если Не ЭтотОбъект.ВыгружатьОтдельнымиФайлами Тогда
			
		ТекЗаписьXML.ЗаписатьКонецЭлемента(); //ГПБ: xmldoc, ВТБ: PacketNso, PacketDeposit
		ТекЗаписьXML.Закрыть();
			
		МассивДанных.Добавить(Новый Структура("СчетДоверительногоУправления, ВидРаспоряжения, Ставка, Сумма, ВременныйФайл, ТекстСообщения", Неопределено, ВидРаспоряжения, "", "", ИмяФайла));
		
	КонецЕсли;
		
	Возврат МассивДанных;
	
КонецФункции

Функция ПолучитьИмяФайла()
	
	Если ЭтотОбъект.РежимВыгрузки = "ГПБ" Тогда
		
		ИмяФайла = ПолучитьИмяВременногоФайла("xml");
		
	ИначеЕсли ЭтотОбъект.РежимВыгрузки = "ВТБ" Тогда
		
		Каталог = ОбщегоНазначенияКлиентСервер.ПолучитьКаталогВременныхФайлов();
	
		ИмяФайла = Каталог + Строка(Новый УникальныйИдентификатор) + ".xml";
		
	КонецЕсли;
	
	Возврат ИмяФайла;
	
КонецФункции

Функция ПолучитьЗаписьXML(ИмяФайла, ВидРаспоряжения)
	
	ЗаписьXML = Новый ЗаписьXML;
	
	Если ЭтотОбъект.РежимВыгрузки = "ГПБ" Тогда
					
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "windows-1251");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		ЗаписьXML.ЗаписатьНачалоЭлемента("xmldoc");
 		
	ИначеЕсли ЭтотОбъект.РежимВыгрузки = "ВТБ" Тогда
				
		ЗаписьXML.ОткрытьФайл(ИмяФайла, "UTF-8");
		ЗаписьXML.ЗаписатьОбъявлениеXML();
		
		Если ВидРаспоряжения = "МНО" Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("PacketNso");
			ЗаписьXML.ЗаписатьАтрибут("xmlns", "PacketNso");
			
		ИначеЕсли ВидРаспоряжения = "Депозит" Тогда
			
			ЗаписьXML.ЗаписатьНачалоЭлемента("PacketDeposit");
			ЗаписьXML.ЗаписатьАтрибут("xmlns", "PacketDeposit");
			
		КонецЕсли;
	
	КонецЕсли;
	
	Возврат ЗаписьXML;
	
КонецФункции

Функция ПолучитьТипыАтрибутов() 
	
	ТипыАтрибутов = Новый Соответствие;
	
	ТипыАтрибутов.Вставить("DC_RECIPIENT_ACCOUNT_OWN", "boolean");
	ТипыАтрибутов.Вставить("DC_RETURN_DATE", "date");
	ТипыАтрибутов.Вставить("DC_AGREEMENT_DATE", "date");
	ТипыАтрибутов.Вставить("DC_DISPOSAL_DATE", "date");
	ТипыАтрибутов.Вставить("DC_INTEREST_RATE", "double");
	ТипыАтрибутов.Вставить("DC_RESTTYPE", "integer");
	ТипыАтрибутов.Вставить("OHD_DATE", "date");
	ТипыАтрибутов.Вставить("OHD_AMOUNT", "currency");
	
	Возврат ТипыАтрибутов;
	
КонецФункции

#КонецОбласти
